Repository: zquestz/dream-background-remover
Catalog: locale/*.po
Languages: bn, es, fr, hi, ja, pt, ru

source: AI-powered background removal with Replicate
bn: Replicate এর সাথে AI-চালিত পটভূমি অপসারণ
es: Eliminación de fondo con IA usando Replicate
fr: Suppression d'arrière-plan IA avec Replicate
hi: Replicate के साथ AI-संचालित पृष्ठभूमि हटाना
ja: ReplicateによるAI背景除去
pt: Remoção de fundo com IA usando Replicate
ru: Удаление фона с помощью ИИ на базе Replicate

source: API key is required
bn: API কী প্রয়োজন
es: Se requiere clave de API
fr: Clé API requise
hi: API कुंजी आवश्यक है
ja: APIキーが必要です
pt: Chave da API é obrigatória
ru: Требуется ключ API

source: Background Removal Error
bn: পটভূমি অপসারণ ত্রুটি
es: Error de Eliminación de Fondo
fr: Erreur de Suppression d'Arrière-plan
hi: पृष्ठभूमि हटाने की त्रुटि
ja: 背景除去エラー
pt: Erro de Remoção de Fundo
ru: Ошибка удаления фона

source: Background Removed
bn: পটভূমি অপসারণ করা হয়েছে
es: Fondo Eliminado
fr: Arrière-plan Supprimé
hi: पृष्ठभूमि हटा दी गई
ja: 背景除去済み
pt: Fundo Removido
ru: Фон удален

source: Background removal complete!
bn: পটভূমি অপসারণ সম্পন্ন!
es: ¡Eliminación de fondo completada!
fr: Suppression de l'arrière-plan terminée !
hi: पृष्ठभूमि हटाना पूरा हो गया!
ja: 背景除去が完了しました！
pt: Remoção de fundo concluída!
ru: Удаление фона завершено!

source: Cancel
bn: বাতিল
es: Cancelar
fr: Annuler
hi: रद्द करें
ja: キャンセル
pt: Cancelar
ru: Отмена

source: Cancelling...
bn: বাতিল করা হচ্ছে...
es: Cancelando...
fr: Annulation...
hi: रद्द किया जा रहा है...
ja: キャンセル中...
pt: Cancelando...
ru: Отмена...

source: Create File
bn: ফাইল তৈরি করুন
es: Crear Archivo
fr: Créer Fichier
hi: फ़ाइल बनाएं
ja: ファイル作成
pt: Criar Arquivo
ru: Создать файл

source: Create Layer
bn: স্তর তৈরি করুন
es: Crear Capa
fr: Créer Calque
hi: परत बनाएं
ja: レイヤー作成
pt: Criar Camada
ru: Создать слой

source: Create a new image file with background removed from '{layer}'
bn: '{layer}' থেকে পটভূমি অপসারণ করে একটি নতুন ছবির ফাইল তৈরি করুন
es: Crear un nuevo archivo de imagen con el fondo eliminado de '{layer}'
fr: Créer un nouveau fichier image avec l'arrière-plan supprimé de '{layer}'
hi: '{layer}' से पृष्ठभूमि हटाकर नई छवि फ़ाइल बनाएं
ja: '{layer}'から背景を除去した新しい画像ファイルを作成
pt: Criar um novo arquivo de imagem com fundo removido de '{layer}'
ru: Создать новый файл изображения с удаленным фоном из '{layer}'

source: Create a new layer with background removed from '{layer}'
bn: '{layer}' থেকে পটভূমি অপসারণ করে একটি নতুন স্তর তৈরি করুন
es: Crear una nueva capa con el fondo eliminado de '{layer}'
fr: Créer un nouveau calque avec l'arrière-plan supprimé de '{layer}'
hi: '{layer}' से पृष्ठभूमि हटाकर नई परत बनाएं
ja: '{layer}'から背景を除去した新しいレイヤーを作成
pt: Criar uma nova camada com fundo removido de '{layer}'
ru: Создать новый слой с удаленным фоном из '{layer}'

source: Creating new image file...
bn: নতুন ছবির ফাইল তৈরি করা হচ্ছে...
es: Creando nuevo archivo de imagen...
fr: Création d'un nouveau fichier image...
hi: नई छवि फ़ाइल बनाई जा रही है...
ja: 新しい画像ファイルを作成中...
pt: Criando novo arquivo de imagem...
ru: Создание нового файла изображения...

source: Creating new layer...
bn: নতুন স্তর তৈরি করা হচ্ছে...
es: Creando nueva capa...
fr: Création d'un nouveau calque...
hi: नई परत बनाई जा रही है...
ja: 新しいレイヤーを作成中...
pt: Criando nova camada...
ru: Создание нового слоя...

source: Current Layer
bn: বর্তমান স্তর
es: Capa Actual
fr: Calque Actuel
hi: वर्तमान परत
ja: 現在のレイヤー
pt: Camada Atual
ru: Текущий слой

source: Downloading result...
bn: ফলাফল ডাউনলোড করা হচ্ছে...
es: Descargando resultado...
fr: Téléchargement du résultat...
hi: परिणाम डाउनलोड हो रहा है...
ja: 結果をダウンロード中...
pt: Baixando resultado...
ru: Загрузка результата...

source: Dream Background Remover - AI Background Removal
bn: Dream Background Remover - AI পটভূমি অপসারণ
es: Dream Background Remover - Eliminación de Fondo con IA
fr: Dream Background Remover - Suppression d'Arrière-plan IA
hi: Dream Background Remover - AI पृष्ठभूमि हटाना
ja: Dream Background Remover - AI背景除去
pt: Dream Background Remover - Remoção de Fundo com IA
ru: Dream Background Remover - Удаление фона с помощью ИИ

source: Enter your Replicate API key...
bn: আপনার Replicate API কী প্রবেশ করান...
es: Ingrese su clave de API de Replicate...
fr: Saisissez votre clé API Replicate...
hi: अपनी Replicate API कुंजी दर्ज करें...
ja: Replicate APIキーを入力...
pt: Digite sua chave da API Replicate...
ru: Введите ваш ключ API Replicate...

source: Error processing result: {error}
bn: ফলাফল প্রক্রিয়াকরণে ত্রুটি: {error}
es: Error al procesar resultado: {error}
fr: Erreur lors du traitement du résultat : {error}
hi: परिणाम प्रसंस्करण त्रुटि: {error}
ja: 結果の処理エラー: {error}
pt: Erro ao processar resultado: {error}
ru: Ошибка обработки результата: {error}

source: Error running Dream Background Remover: {error}
bn: Dream Background Remover চালানোতে ত্রুটি: {error}
es: Error al ejecutar Dream Background Remover: {error}
fr: Erreur lors de l'exécution de Dream Background Remover : {error}
hi: Dream Background Remover चलाने में त्रुटि: {error}
ja: Dream Background Removerの実行エラー: {error}
pt: Erro ao executar Dream Background Remover: {error}
ru: Ошибка запуска Dream Background Remover: {error}

source: Failed to convert result to image
bn: ফলাফলকে ছবিতে রূপান্তর করতে ব্যর্থ
es: Error al convertir resultado a imagen
fr: Échec de la conversion du résultat en image
hi: परिणाम को छवि में बदलने में विफल
ja: 結果の画像への変換に失敗しました
pt: Falha ao converter resultado em imagem
ru: Не удалось преобразовать результат в изображение

source: Failed to create new image file
bn: নতুন ছবির ফাইল তৈরি করতে ব্যর্থ
es: Error al crear nuevo archivo de imagen
fr: Échec de la création du nouveau fichier image
hi: नई छवि फ़ाइल बनाने में विफल
ja: 新しい画像ファイルの作成に失敗しました
pt: Falha ao criar novo arquivo de imagem
ru: Не удалось создать новый файл изображения

source: Failed to create new layer
bn: নতুন স্তর তৈরি করতে ব্যর্থ
es: Error al crear nueva capa
fr: Échec de la création du nouveau calque
hi: नई परत बनाने में विफल
ja: 新しいレイヤーの作成に失敗しました
pt: Falha ao criar nova camada
ru: Не удалось создать новый слой

source: Failed to export image data
bn: ছবির ডেটা এক্সপোর্ট করতে ব্যর্থ
es: Error al exportar datos de imagen
fr: Échec de l'exportation des données d'image
hi: छवि डेटा निर्यात करने में विफल
ja: 画像データのエクスポートに失敗しました
pt: Falha ao exportar dados da imagem
ru: Не удалось экспортировать данные изображения

source: Get your API key from <a href="{url}">Replicate</a>
bn: <a href="{url}">Replicate</a> থেকে আপনার API কী নিন
es: Obtenga su clave de API de <a href="{url}">Replicate</a>
fr: Obtenez votre clé API depuis <a href="{url}">Replicate</a>
hi: <a href="{url}">Replicate</a> से अपनी API कुंजी प्राप्त करें
ja: APIキーを<a href="{url}">Replicate</a>から取得
pt: Obtenha sua chave da API em <a href="{url}">Replicate</a>
ru: Получите ваш ключ API на <a href="{url}">Replicate</a>

source: Invalid layer dimensions. Please select a valid layer.
bn: অবৈধ স্তরের মাত্রা। অনুগ্রহ করে একটি বৈধ স্তর নির্বাচন করুন।
es: Dimensiones de capa inválidas. Por favor seleccione una capa válida.
fr: Dimensions de calque invalides. Veuillez sélectionner un calque valide.
hi: अमान्य परत आयाम। कृपया एक मान्य परत चुनें।
ja: 無効なレイヤーサイズです。有効なレイヤーを選択してください。
pt: Dimensões de camada inválidas. Por favor selecione uma camada válida.
ru: Неверные размеры слоя. Пожалуйста, выберите действительный слой.

source: Layer
bn: স্তর
es: Capa
fr: Calque
hi: परत
ja: レイヤー
pt: Camada
ru: Слой

source: Logs
bn: লগ
es: Registros
fr: Journaux
hi: लॉग्स
ja: ログ
pt: Registros
ru: Логи

source: Model error: {error}
bn: মডেল ত্রুটি: {error}
es: Error del modelo: {error}
fr: Erreur du modèle : {error}
hi: मॉडल त्रुटि: {error}
ja: モデルエラー: {error}
pt: Erro do modelo: {error}
ru: Ошибка модели: {error}

source: New image created with background removed!
bn: পটভূমি অপসারণ করে নতুন ছবি তৈরি করা হয়েছে!
es: ¡Nueva imagen creada con el fondo eliminado!
fr: Nouvelle image créée avec l'arrière-plan supprimé !
hi: पृष्ठभूमि हटाकर नई छवि बनाई गई!
ja: 背景を除去した新しい画像が作成されました！
pt: Nova imagem criada com fundo removido!
ru: Новое изображение создано с удаленным фоном!

source: New layer created with background removed!
bn: পটভূমি অপসারণ করে নতুন স্তর তৈরি করা হয়েছে!
es: ¡Nueva capa creada con el fondo eliminado!
fr: Nouveau calque créé avec l'arrière-plan supprimé !
hi: पृष्ठभूमि हटाकर नई परत बनाई गई!
ja: 背景を除去した新しいレイヤーが作成されました！
pt: Nova camada criada com fundo removido!
ru: Новый слой создан с удаленным фоном!

source: No drawable provided
bn: কোন অঙ্কনযোগ্য বস্তু প্রদান করা হয়নি
es: No se proporcionó elemento dibujable
fr: Aucun élément dessinable fourni
hi: कोई चित्रित करने योग्य वस्तु प्रदान नहीं की गई
ja: 描画可能オブジェクトが提供されていません
pt: Nenhum elemento desenhável fornecido
ru: Не предоставлен рисуемый объект

source: No image available. Please open an image first.
bn: কোন ছবি উপলব্ধ নয়। অনুগ্রহ করে প্রথমে একটি ছবি খুলুন।
es: No hay imagen disponible. Por favor abra una imagen primero.
fr: Aucune image disponible. Veuillez d'abord ouvrir une image.
hi: कोई छवि उपलब्ध नहीं है। कृपया पहले एक छवि खोलें।
ja: 画像がありません。まず画像を開いてください。
pt: Nenhuma imagem disponível. Por favor abra uma imagem primeiro.
ru: Изображение недоступно. Пожалуйста, сначала откройте изображение.

source: No image data in API response
bn: API প্রতিক্রিয়ায় কোন ছবির ডেটা নেই
es: No hay datos de imagen en la respuesta de la API
fr: Aucune donnée d'image dans la réponse de l'API
hi: API प्रतिक्रिया में कोई छवि डेटा नहीं
ja: APIレスポンスに画像データがありません
pt: Nenhum dado de imagem na resposta da API
ru: Нет данных изображения в ответе API

source: No layer available for background removal
bn: পটভূমি অপসারণের জন্য কোন স্তর উপলব্ধ নয়
es: No hay capa disponible para eliminación de fondo
fr: Aucun calque disponible pour la suppression d'arrière-plan
hi: पृष्ठभूमि हटाने के लिए कोई परत उपलब्ध नहीं
ja: 背景除去に利用可能なレイヤーがありません
pt: Nenhuma camada disponível para remoção de fundo
ru: Нет доступного слоя для удаления фона

source: No layer selected. Please select a layer to process.
bn: কোন স্তর নির্বাচিত নয়। অনুগ্রহ করে প্রক্রিয়াকরণের জন্য একটি স্তর নির্বাচন করুন।
es: No se seleccionó ninguna capa. Por favor seleccione una capa a procesar.
fr: Aucun calque sélectionné. Veuillez sélectionner un calque à traiter.
hi: कोई परत चयनित नहीं है। कृपया प्रसंस्करण के लिए एक परत चुनें।
ja: レイヤーが選択されていません。処理するレイヤーを選択してください。
pt: Nenhuma camada selecionada. Por favor selecione uma camada para processar.
ru: Слой не выбран. Пожалуйста, выберите слой для обработки.

source: No output received from API
bn: API থেকে কোন আউটপুট পাওয়া যায়নি
es: No se recibió respuesta de la API
fr: Aucune sortie reçue de l'API
hi: API से कोई आउटपुट प्राप्त नहीं हुआ
ja: APIからの出力がありません
pt: Nenhuma resposta recebida da API
ru: Не получен ответ от API

source: Operation cancelled
bn: অপারেশন বাতিল করা হয়েছে
es: Operación cancelada
fr: Opération annulée
hi: संचालन रद्द कर दिया गया
ja: 操作がキャンセルされました
pt: Operação cancelada
ru: Операция отменена

source: Output Mode
bn: আউটপুট মোড
es: Modo de Salida
fr: Mode de Sortie
hi: आउटपुट मोड
ja: 出力モード
pt: Modo de Saída
ru: Режим вывода

source: Please enter your Replicate API key
bn: অনুগ্রহ করে আপনার Replicate API কী প্রবেশ করান
es: Por favor ingrese su clave de API de Replicate
fr: Veuillez saisir votre clé API Replicate
hi: कृपया अपनी Replicate API कुंजी दर्ज करें
ja: Replicate APIキーを入力してください
pt: Por favor insira sua chave da API Replicate
ru: Пожалуйста, введите ваш ключ API Replicate

source: Preparing image for upload...
bn: আপলোডের জন্য ছবি প্রস্তুত করা হচ্ছে...
es: Preparando imagen para subir...
fr: Préparation de l'image pour téléchargement...
hi: अपलोड के लिए छवि तैयार की जा रही है...
ja: 画像をアップロード用に準備中...
pt: Preparando imagem para envio...
ru: Подготовка изображения к загрузке...

source: Processing image...
bn: ছবি প্রক্রিয়াকরণ...
es: Procesando imagen...
fr: Traitement de l'image...
hi: छवि प्रसंस्करण...
ja: 画像を処理中...
pt: Processando imagem...
ru: Обработка изображения...

source: Ready
bn: প্রস্তুত
es: Listo
fr: Prêt
hi: तैयार
ja: 準備完了
pt: Pronto
ru: Готово

source: Remove Background
bn: পটভূমি অপসারণ করুন
es: Eliminar Fondo
fr: Supprimer l'Arrière-plan
hi: पृष्ठभूमि हटाएं
ja: 背景を除去
pt: Remover Fundo
ru: Удалить фон

source: Remove background from '{layer}' and create a new image file
bn: '{layer}' থেকে পটভূমি অপসারণ করুন এবং একটি নতুন ছবির ফাইল তৈরি করুন
es: Eliminar fondo de '{layer}' y crear un nuevo archivo de imagen
fr: Supprimer l'arrière-plan de '{layer}' et créer un nouveau fichier image
hi: '{layer}' से पृष्ठभूमि हटाएं और नई छवि फ़ाइल बनाएं
ja: '{layer}'から背景を除去して新しい画像ファイルを作成
pt: Remover fundo de '{layer}' e criar um novo arquivo de imagem
ru: Удалить фон из '{layer}' и создать новый файл изображения

source: Remove background from '{layer}' and create a new layer
bn: '{layer}' থেকে পটভূমি অপসারণ করুন এবং একটি নতুন স্তর তৈরি করুন
es: Eliminar fondo de '{layer}' y crear una nueva capa
fr: Supprimer l'arrière-plan de '{layer}' et créer un nouveau calque
hi: '{layer}' से पृष्ठभूमि हटाएं और नई परत बनाएं
ja: '{layer}'から背景を除去して新しいレイヤーを作成
pt: Remover fundo de '{layer}' e criar uma nova camada
ru: Удалить фон из '{layer}' и создать новый слой

source: Remove backgrounds from images using AI. Choose to create a new layer in the current image or generate a new image file with the background removed.
bn: AI ব্যবহার করে ছবি থেকে পটভূমি অপসারণ করুন। বর্তমান ছবিতে একটি নতুন স্তর তৈরি করতে বা পটভূমি অপসারণ করে একটি নতুন ছবির ফাইল তৈরি করতে বেছে নিন।
es: Elimine fondos de imágenes usando IA. Elija crear una nueva capa en la imagen actual o generar un nuevo archivo de imagen con el fondo eliminado.
fr: Supprimez les arrière-plans des images en utilisant l'IA. Choisissez de créer un nouveau calque dans l'image actuelle ou de générer un nouveau fichier image avec l'arrière-plan supprimé.
hi: AI का उपयोग करके छवियों से पृष्ठभूमि हटाएं। वर्तमान छवि में नई परत बनाने या पृष्ठभूमि हटाकर नई छवि फ़ाइल बनाने का विकल्प चुनें।
ja: AIを使用して画像から背景を除去します。現在の画像に新しいレイヤーを作成するか、背景を除去した新しい画像ファイルを生成するかを選択してください。
pt: Remova fundos de imagens usando IA. Escolha criar uma nova camada na imagem atual ou gerar um novo arquivo de imagem com o fundo removido.
ru: Удаляйте фоны с изображений с помощью ИИ. Выберите создание нового слоя в текущем изображении или генерацию нового файла изображения с удаленным фоном.

source: Replicate API Key
bn: Replicate API কী
es: Clave de API de Replicate
fr: Clé API Replicate
hi: Replicate API कुंजी
ja: Replicate APIキー
pt: Chave da API Replicate
ru: Ключ API Replicate

source: Replicate API error: {error}
bn: Replicate API ত্রুটি: {error}
es: Error de API de Replicate: {error}
fr: Erreur de l'API Replicate : {error}
hi: Replicate API त्रुटि: {error}
ja: Replicate APIエラー: {error}
pt: Erro da API Replicate: {error}
ru: Ошибка API Replicate: {error}

source: Replicate package not installed. Please run: pip install replicate
bn: Replicate প্যাকেজ ইনস্টল করা নেই। অনুগ্রহ করে চালান: pip install replicate
es: Paquete Replicate no instalado. Por favor ejecute: pip install replicate
fr: Package Replicate non installé. Veuillez exécuter : pip install replicate
hi: Replicate पैकेज इंस्टॉल नहीं है। कृपया चलाएं: pip install replicate
ja: Replicateパッケージがインストールされていません。pip install replicate を実行してください
pt: Pacote Replicate não instalado. Por favor execute: pip install replicate
ru: Пакет Replicate не установлен. Пожалуйста, выполните: pip install replicate

source: Show/Hide API key
bn: API কী দেখান/লুকান
es: Mostrar/Ocultar clave de API
fr: Afficher/Masquer la clé API
hi: API कुंजी दिखाएं/छुपाएं
ja: APIキーを表示/非表示
pt: Mostrar/Ocultar chave da API
ru: Показать/скрыть ключ API

source: Source Image
bn: উৎস ছবি
es: Imagen Fuente
fr: Image Source
hi: स्रोत छवि
ja: ソース画像
pt: Imagem Origem
ru: Исходное изображение

source: Source: {name} ({width}×{height}px)
bn: উৎস: {name} ({width}×{height}px)
es: Fuente: {name} ({width}×{height}px)
hi: स्रोत: {name} ({width}×{height}px)
ja: ソース: {name} ({width}×{height}px)
pt: Origem: {name} ({width}×{height}px)
ru: Источник: {name} ({width}×{height}px)

source: Unexpected error: {error}
bn: অপ্রত্যাশিত ত্রুটি: {error}
es: Error inesperado: {error}
fr: Erreur inattendue : {error}
hi: अप्रत्याशित त्रुटि: {error}
ja: 予期しないエラー: {error}
pt: Erro inesperado: {error}
ru: Неожиданная ошибка: {error}

source: Uploading image to Replicate...
bn: Replicate এ ছবি আপলোড করা হচ্ছে...
es: Subiendo imagen a Replicate...
fr: Téléchargement de l'image vers Replicate...
hi: Replicate पर छवि अपलोड की जा रही है...
ja: Replicateに画像をアップロード中...
pt: Enviando imagem para Replicate...
ru: Загрузка изображения в Replicate...
